Repository: emandonia/MnfUniversity-Portals
Catalog: Portal/UI/App_LocalResources/AllUni_Rss.aspx.*.resx
Languages: ar

# facName1.Text
source: Menofia University
ar: جامعة المنوفية

# facName10.Text
source: Kafer El-sheikh University
ar: جامعة كفرالشيخ

# facName11.Text
source: South Vally University
ar: جامعة جنوب الوادى

# facName12.Text
source: Mansoura University
ar: جامعة المنصورة

# facName13.Text
source: Sohag University
ar: جامعة سوهاج

# facName14.Text
source: Elsadat University
ar: جامعة السادات

# facName15.Text
source: Zagazig University
ar: جامعة الزقازيق

# facName16.Text
source: Domiat University
ar: جامعة دمياط

# facName17.Text
source: Fayom University
ar: جامعة الفيوم

# facName2.Text
source: Tanta University
ar: جامعة طنطا

# facName3.Text
source: Cairo University
ar: جامعة القاهرة

# facName4.Text
source: Aswan University
ar: جامعة اسوان

# facName5.Text
source: Menia University
ar: جامعة المنيا

# facName6.Text
source: Banha University
ar: جامعة بنها

# facName7.Text
source: Assiut University
ar: جامعة اسيوط

# facName8.Text
source: Suez Canal University
ar: جامعة قناة السويس

# facName9.Text
source: Port Said University
ar: جامعة بورسعيد
